Repository: marvlent/calculator-yasalam
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ar, fr

source: Stop
ar: توقف
fr: Arrêter

source: Error: Please enter a number like 1, 2.5, -3.
ar: خطأ: الرجاء إدخال رقم مثل 1، 2.5، -3.
fr: Erreur : Veuillez entrer un nombre comme 1, 2.5, -3.

source: Enter a number or type 'Stop' to stop:
ar: أدخل رقمًا أو اكتب 'توقف' للتوقف:
fr: Entrez un nombre ou tapez 'Arrêter' pour arrêter :

source: Enter first number:
ar: أدخل الرقم الأول:
fr: Entrez le premier nombre :

source: Enter second number:
ar: أدخل الرقم الثاني:
fr: Entrez le deuxième nombre :

source: Cannot divide by zero. Please try again.
ar: لا يمكن القسمة على الصفر. حاول مرة أخرى.
fr: Impossible de diviser par zéro. Veuillez réessayer.

source: Enter the base number:
ar: أدخل الرقم الأساسي:
fr: Entrez le nombre de base :

source: Enter the exponent:
ar: أدخل الأس:
fr: Entrez l'exposant :

source: Choose an operation: add, Subtract, multiply, divide, exponentiate (or 'exit'):
ar: اختر عملية: add، Subtract، multiply، divide، exponentiate (أو 'exit'):
fr: Choisissez une opération : additionner, soustraire, multiplier, diviser, exponentier (ou 'quitter') :

source: exit
ar: خروج
fr: quitter

source: Goodbye!
ar: مع السلامة!
fr: Au revoir !

source: That's not a valid option. Please choose from: add, Subtract, multiply, divide, exponentiate (or 'exit'):
ar: هذا خيار غير صالح. الرجاء اختيار: add، Subtract، multiply، divide، exponentiate (أو 'exit'):
fr: Ce n'est pas une option valide. Veuillez choisir parmi : additionner, soustraire, multiplier, diviser, exponentier (ou 'quitter') :

source: result {Division():.2f}
ar: النتيجة {Division():.2f}
fr: résultat {Division():.2f}

source: Choose another operation: add, Subtract, multiply, divide, exponentiate (or 'exit'):
ar: اختر عملية أخرى: add، Subtract، multiply، divide، exponentiate (أو 'exit'):
fr: Choisissez une autre opération : additionner, soustraire, multiplier, diviser, exponentier (ou 'quitter') :
